### Step 1 - Import Libraries and read The Data

In [72]:
import pandas as pd

In [73]:
df=pd.read_csv('mldata.csv')
df.head()

   age  weight gender likeness   height
0   27    76.0   Male  Biryani  170.688
1   41    70.0   Male  Biryani      165
2   29    80.0   Male  Biryani      171
3   27   102.0   Male  Biryani      173
4   29    67.0   Male  Biryani      164

### Step 2 - Clean the Data (Data Wragling)

In [74]:
df.isnull().sum()

age         0
weight      0
gender      0
likeness    0
height      0
dtype: int64

In [75]:
df.shape

(245, 5)

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 245 entries, 0 to 244
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       245 non-null    int64
 1   weight    245 non-null    float64
 2   gender    245 non-null    object
 3   likeness  245 non-null    object
 4   height    245 non-null    object
dtypes: float64(1), int64(1), object(3)
memory usage: 9.7+ KB

In [77]:
height=df['height']
height.head()

0    170.688
1        165
2        171
3        173
4        164
Name: height, dtype: object

In [78]:
df.tail()

     age  weight  gender likeness height
240   31    60.0    Male   Pakora    160
241   26    70.0    Male  Biryani    172
242   40    80.0    Male  Biryani    178
243   25    65.0    Male  Biryani    5.7
244   33    56.0  Female   Samosa    157

In [80]:
# new_df=df['height'].astype('float64')

In [81]:
v=['5.3']

In [82]:
df[df.height.isin(v)]

     age  weight  gender likeness height
207   28    62.0  Female  Biryani    5.3

In [83]:
new=pd.DataFrame(df)

In [84]:
new.height.replace(v,5.5)

0      170.688
1          165
2          171
3          173
4          164
        ...
240        160
241        172
242        178
243        5.7
244        157
Name: height, Length: 245, dtype: object

In [85]:
df[df.height.isin(v)]

     age  weight  gender likeness height
207   28    62.0  Female  Biryani    5.3

In [86]:
df.drop(207)

     age  weight  gender likeness   height
0     27    76.0    Male  Biryani  170.688
1     41    70.0    Male  Biryani      165
2     29    80.0    Male  Biryani      171
3     27   102.0    Male  Biryani      173
4     29    67.0    Male  Biryani      164
..   ...     ...     ...      ...      ...
240   31    60.0    Male   Pakora      160
241   26    70.0    Male  Biryani      172
242   40    80.0    Male  Biryani      178
243   25    65.0    Male  Biryani      5.7
244   33    56.0  Female   Samosa      157

[244 rows x 5 columns]

In [87]:
df.shape

(245, 5)